Revit 2027 API
BuiltInFailures.ConnectorFailures.JointSizeMismatch Property
 The element has a connector with a fitting joint size mismatch
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId JointSizeMismatch { get; }
Public Shared ReadOnly Property JointSizeMismatch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ JointSizeMismatch {
	FailureDefinitionId^ get ();
}
static member JointSizeMismatch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace